### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
l=[3,8,15,16,23,42]
a =pd.Series(l)
print(type(a))

<class 'pandas.core.series.Series'>

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
import pandas as pd
l=[3,8,15,16,23,42,33,44,67,98]
a =pd.Series(l)
print(a)

0     3
1     8
2    15
3    16
4    23
5    42
6    33
7    44
8    67
9    98
dtype: int64

In [10]:
data ={
    'Name':["Alice","Bob","Claire"],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}
dframe = pd.DataFrame(data)
print(dframe)
print(type(dframe))

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
ans:<br>
DataFrame in pandas is a indexed list containing multiple columns as list<br>
while,<br>
A series just contain a single indexed column.

In [11]:
#example
#series
print(a)
print(type(a))
print('---------------------------------------')
print(dframe)
print(type(dframe))

0     3
1     8
2    15
3    16
4    23
5    42
6    33
7    44
8    67
9    98
dtype: int64
<class 'pandas.core.series.Series'>
---------------------------------------
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
<class 'pandas.core.frame.DataFrame'>

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
ans:<br>
All Pandas data structures are value mutable (can be changed) and except Series all are size mutable. **Series is size immutable.**

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
using concatinate method

In [20]:
s1=pd.Series([i**2 for i in range(1,11)],name='square')
s2=pd.Series([i**3 for i in range(1,11)],name='cube')
s3=pd.Series([i**0.5 for i in range(1,11)],name='sqr_root')
df = pd.concat([s1,s2,s3],axis=1)
df

   square  cube  sqr_root
0       1     1  1.000000
1       4     8  1.414214
2       9    27  1.732051
3      16    64  2.000000
4      25   125  2.236068
5      36   216  2.449490
6      49   343  2.645751
7      64   512  2.828427
8      81   729  3.000000
9     100  1000  3.162278

using Dataframe constructor

In [19]:
s1=pd.Series([i**2 for i in range(1,11)])
s2=pd.Series([i**3 for i in range(1,11)])
s3=pd.Series([i**0.5 for i in range(1,11)])
pd.DataFrame({"sqr":s1,"cube":s2,"sqr_root":s3})

   sqr  cube  sqr_root
0    1     1  1.000000
1    4     8  1.414214
2    9    27  1.732051
3   16    64  2.000000
4   25   125  2.236068
5   36   216  2.449490
6   49   343  2.645751
7   64   512  2.828427
8   81   729  3.000000
9  100  1000  3.162278